# Delete Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintSetup..::..Delete Method
PrintSetup Class See Also
---
Delete the current print setting, and make the In-Session setting as the current one.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Delete()
```

Visual Basic
---
```text
Public Function Delete As Boolean
```

Visual C++
---
```text
public:
bool Delete()
```

# ### Return Value
False if Delete operation fails, otherwise true.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the current print setting is In-Session. |

# See Also
PrintSetup Class
Autodesk.Revit.DB Namespace